---
kind: type
id: T:Autodesk.Revit.DB.SpatialElementFromToCalculationPoints
source: html/a6fe424e-af41-c1de-7bc2-e6facd9f2386.htm
---
# Autodesk.Revit.DB.SpatialElementFromToCalculationPoints

SpatialElementFromToCalculationPoints is used to specify the search points for a family instance which connects
 two rooms or spaces, such as a door or window. The points determine which room or space is considered the "from"
 and which is considered the "to".

## Syntax (C#)
```csharp
public class SpatialElementFromToCalculationPoints : SpatialElementCalculationLocation
```